"""
dict 练习
"""
# 通过 for 循环，对所有级别为 1 级的员工，级别上升 1 级，薪水增加 1000 元
my_dict = {
    "王力泓": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    }, "周杰轮": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    }, "林俊节": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    }, "张学油": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    }, "刘德滑": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}
print(f"全体员工当前信息: {my_dict}")
for key in my_dict:
    if my_dict[key]["级别"] == 1:
        my_dict[key]["级别"] += 1
        my_dict[key]["工资"] += 1000
print(f"全体员工级别 1 升值加薪后: {my_dict}")